using System;
using System.Collections.Generic;
using System.IO;
using System.Linq;
using System.Threading.Tasks;

namespace TextAnalyser.Constants
{
    public static class Constants
    {
        public enum Part
        {
            іменник_жіночого_роду = 5,
            іменник_жіночого_роду_істота,
            іменник_чоловічого_роду_істота,
            іменник_чоловічого_роду,
            числівник_кількісний,
            дієприкметник,
            прикметник,
            іменник_середнього_роду = 13,
            множинний_іменник,
            займенник,
            займенник_прикметник,
            числівник_порядковий,
            числівник_типу_два,
            числівник_типу_один,
            іменник_чоловічого_і_жіночого_роду_істота = 21,
            іменник_чоловічого_і_середнього_роду_істота,
            іменник_жіночого_і_середнього_роду_істота,
            іменник_жіночого_і_чоловічого_роду_істота,
            прикметник_множинний,
            множинний_іменник_істоти = 27,
            прикметник_вищий_ступінь,
            прикметник_найвищий_ступінь,
            прикметник_з_прислівником,
            дієприкметник_з_прислівником,
            прізвище_1,
            прізвище_2,
            прізвище,
            дієслово_доконаного_виду,
            дієслово_недоконаного_виду,
            дієслово_недоконаного_і_доконаного_виду,
            іменник_чоловічого_і_жіночого_роду,
            іменник_жіночого_і_чоловічого_роду,
            іменник_чоловічого_і_середнього_роду,
            іменник_жіночого_і_середнього_роду,
            іменник_середнього_роду_істота = 55,
            власна_назва,
            без_коментарів,
            займенник_жіночого_роду = 61,
            займенник_середнього_роду,
            займенник_pluralia_tantum,
            займенник_чоловічого_роду,
            прислiвник = 71,
            вигук,
            сполучник,
            частка,
            прийменник,
            присудкове_слово,
            вставне_слово,
            незмінне_слово,
            абревiатура,
            словосполучення,
            дієприслівник,
            займенник_з_часткою,
            сполучник_з_часткою,
            прислівник_і_частка = 86,
            числівник_з_прийменником,
            іменник_з_прийменником,
            прислівник_з_частками,
            займенник_з_прийменником,
            дієприслівник_з_часткою,
            прислівник_з_займенником,
            сполучник_з_займенником,
            сполучник_з_займенником_і_часткою,
            прислівниковий_еквівалент_слова,
            сполучниковий_еквівалент_слова,
            прикметник_коротка_форма,
            прикметник_невідмінюване_слово
        }

        public static List<int> NounTypes = new List<int>() { (int)Part.іменник_жіночого_і_середнього_роду, (int)Part.іменник_жіночого_і_середнього_роду_істота, (int)Part.іменник_жіночого_і_чоловічого_роду,
                    (int)Part.іменник_жіночого_і_чоловічого_роду_істота, (int)Part.іменник_жіночого_роду, (int)Part.іменник_жіночого_роду_істота,
                    (int)Part.іменник_з_прийменником, (int)Part.іменник_середнього_роду, (int)Part.іменник_середнього_роду_істота,
                    (int)Part.іменник_чоловічого_і_жіночого_роду, (int)Part.іменник_чоловічого_і_жіночого_роду_істота,
                    (int)Part.іменник_чоловічого_і_середнього_роду, (int)Part.іменник_чоловічого_і_середнього_роду_істота,
                    (int)Part.іменник_чоловічого_роду, (int)(int)Part.іменник_чоловічого_роду_істота };

        public static string Alphabet = "абвгґдеєжзиіїйклмнопрстуфхцчшщюя";

        public static char[] Vowles = "аеиіоуяюєї".ToCharArray();

        public static char[] sentencesSeparator = { '.', '?', '!' };

        public static char[] wordSeperators = { ' ', ',', '.', '?', '!', ';', ':', '"', '(', ')', '—', '-', '1', '2', '3', '4', '5', '6', '7', '8', '9', '0', '[', ']', '#', '№', '$', '%', '*', '@', '`', '\'', '\\', '/', '|', '\n', '\t', '«', '»' };

        public static string[] StopWordsList = File.ReadAllLines("StopWords.txt");

    }
}
